masarray/arstack61850/embedded/esp32p4_smv_injector/main/ptp_lab_task.cpp
#if defined(SOC_EMAC_IEEE1588V2_SUPPORTED) && SOC_EMAC_IEEE1588V2_SUPPORTED && ESP_IDF_VERSION_MAJOR < 6

[[nodiscard]] bool valid_hw_timestamp(const eth_mac_time_t& timestamp) noexcept {
    return timestamp.nanoseconds < 1'000'000'000U &&
           (timestamp.seconds != 0U || timestamp.nanoseconds != 0U);
}

[[nodiscard]] PtpTimestamp to_ptp_timestamp(const eth_mac_time_t& timestamp) noexcept {
    return {
        static_cast<std::uint64_t>(timestamp.seconds),
        timestamp.nanoseconds,
    };
}

[[nodiscard]] bool enable_hardware_ptp(const esp_eth_handle_t eth_handle) noexcept {
    bool enable = true;
    const auto result = esp_eth_ioctl(
        eth_handle,
        static_cast<esp_eth_io_cmd_t>(ETH_MAC_ESP_CMD_PTP_ENABLE),
        &enable);
    if (result != ESP_OK) {
        ESP_LOGE(kTag, "Failed to enable ESP32-P4 IEEE1588 hardware clock: %s",
                 esp_err_to_name(result));
        return false;
    }
    return true;
}

void seed_hardware_clock(const esp_eth_handle_t eth_handle) noexcept {
    eth_mac_time_t initial_time{};
    const std::time_t system_time = std::time(nullptr);
    if (system_time > 0 &&
        static_cast<std::uint64_t>(system_time) <= std::numeric_limits<std::uint32_t>::max()) {
        initial_time.seconds = static_cast<std::uint32_t>(system_time);
    }
    const auto result = esp_eth_ioctl(
        eth_handle,
        static_cast<esp_eth_io_cmd_t>(ETH_MAC_ESP_CMD_S_PTP_TIME),
        &initial_time);
    if (result != ESP_OK) {
        ESP_LOGW(kTag, "Unable to seed hardware PTP time: %s", esp_err_to_name(result));
    }
}

[[nodiscard]] PtpTimestamp hardware_time(const esp_eth_handle_t eth_handle) noexcept {
    eth_mac_time_t timestamp{};
    const auto result = esp_eth_ioctl(
        eth_handle,
        static_cast<esp_eth_io_cmd_t>(ETH_MAC_ESP_CMD_G_PTP_TIME),
        &timestamp);
    if (result != ESP_OK || timestamp.nanoseconds >= 1'000'000'000U) {
        return {};
    }
    return to_ptp_timestamp(timestamp);
}

[[nodiscard]] bool send_frame(
    const esp_eth_handle_t eth_handle,
    std::vector<std::uint8_t>& frame) noexcept {
    if (frame.empty()) return false;
    return esp_eth_transmit(eth_handle, frame.data(), frame.size()) == ESP_OK;
}

[[nodiscard]] bool transmit_with_hw_timestamp(
    const esp_eth_handle_t eth_handle,
    std::vector<std::uint8_t>& frame,
    PtpTimestamp& timestamp) noexcept {
    if (frame.empty()) return false;
    eth_mac_time_t tx_timestamp{};
    const auto result = esp_eth_transmit_ctrl_vargs(
        eth_handle,
        &tx_timestamp,
        2U,
        frame.data(),
        frame.size());
    if (result != ESP_OK || !valid_hw_timestamp(tx_timestamp)) {
        return false;
    }
    timestamp = to_ptp_timestamp(tx_timestamp);
    return true;
}

[[nodiscard]] bool send_sync_follow_up(PtpLabContext& context) {
    if (!context.runtime.has_value()) return false;
    auto& runtime = *context.runtime;

    auto sync = runtime.prepare_sync(PtpTimestamp{});
    if (!sync.has_value()) return false;

    PtpTimestamp tx_timestamp;
    if (!transmit_with_hw_timestamp(
            context.eth_handle,
            sync->ethernet_frame,
            tx_timestamp)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::sync);
    record_live_sent(PtpMessageType::sync);

    auto follow_up = runtime.prepare_follow_up(sync->sequence_id, tx_timestamp);
    if (!follow_up.has_value() ||
        !send_frame(context.eth_handle, follow_up->ethernet_frame)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::follow_up);
    record_live_sent(PtpMessageType::follow_up);
    return true;
}

[[nodiscard]] bool send_announce(PtpLabContext& context) {
    if (!context.runtime.has_value()) return false;
    auto& runtime = *context.runtime;
    auto announce = runtime.prepare_announce(hardware_time(context.eth_handle));
    if (!announce.has_value() ||
        !send_frame(context.eth_handle, announce->ethernet_frame)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::announce);
    record_live_sent(PtpMessageType::announce);
    return true;
}

[[nodiscard]] bool send_pdelay_response(
    PtpLabContext& context,
    const PdelayRequestEvent& request) {
    if (!context.runtime.has_value()) return false;
    auto& runtime = *context.runtime;

    auto response = runtime.prepare_pdelay_response(
        request.requesting_port_identity,
        request.sequence_id,
        request.log_message_interval,
        request.receive_timestamp);
    if (!response.has_value()) return false;

    PtpTimestamp response_tx_timestamp;
    if (!transmit_with_hw_timestamp(
            context.eth_handle,
            response->ethernet_frame,
            response_tx_timestamp)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::pdelay_resp);
    record_live_sent(PtpMessageType::pdelay_resp);

    auto follow_up = runtime.prepare_pdelay_response_follow_up(
        request.requesting_port_identity,
        request.sequence_id,
        request.log_message_interval,
        response_tx_timestamp);
    if (!follow_up.has_value() ||
        !send_frame(context.eth_handle, follow_up->ethernet_frame)) {
        return false;
    }
    runtime.record_sent(PtpMessageType::pdelay_resp_follow_up);
    record_live_sent(PtpMessageType::pdelay_resp_follow_up);

    if (g_pdelay_frames_sent.load(std::memory_order_relaxed) == 2U) {
        ESP_LOGI(kTag, "First hardware-timestamped Pdelay exchange completed");
    }
    return true;
}

esp_err_t ptp_input_info(
    esp_eth_handle_t,
    std::uint8_t* buffer,
    const std::uint32_t length,
    void* priv,
    void* info) {
    auto* context = static_cast<PtpLabContext*>(priv);
    if (buffer == nullptr) return ESP_OK;

    if (g_ptp_started.load(std::memory_order_acquire) &&
        context != nullptr &&
        context->runtime.has_value() &&
        context->runtime->options().respond_to_peer_delay &&
        context->pdelay_queue != nullptr &&
        info != nullptr) {
        PtpFrame frame;
        const auto& profile = context->runtime->options();
        if (ar::iec61850::time_sync::PtpCodec::try_parse_ethernet_frame(
                std::span<const std::uint8_t>{buffer, length},
                frame) &&
            frame.peer_delay_multicast &&
            frame.header.message_type == PtpMessageType::pdelay_req &&
            frame.header.domain_number == profile.domain_number &&
            frame.header.transport_specific == profile.transport_specific) {
            const auto& rx_timestamp = *static_cast<const eth_mac_time_t*>(info);
            if (valid_hw_timestamp(rx_timestamp)) {
                const PdelayRequestEvent event{
                    frame.header.source_port_identity,
                    to_ptp_timestamp(rx_timestamp),
                    frame.header.sequence_id,
                    frame.header.log_message_interval,
                };
                if (xQueueSend(context->pdelay_queue, &event, 0U) == pdTRUE &&
                    context->task_handle != nullptr) {
                    xTaskNotifyGive(context->task_handle);
                }
            }
        }
    }

    std::free(buffer);
    return ESP_OK;
}

