masarray/arstack61850/embedded/esp32p4_smv_injector/main/ptp_lab_task.cpp
void finish_runtime(PtpLabContext& context) {
    if (context.runtime.has_value()) {
        context.runtime->stop();
        const auto status = context.runtime->status();
        ESP_LOGI(kTag,
                 "PTP stopped: Announce=%llu Sync=%llu FollowUp=%llu PdelayFrames=%llu%s%s",
                 static_cast<unsigned long long>(status.announce_sent),
                 static_cast<unsigned long long>(status.sync_sent),
                 static_cast<unsigned long long>(status.follow_up_sent),
                 static_cast<unsigned long long>(status.peer_delay_responses_sent),
                 status.last_error.empty() ? "" : " lastError=",
                 status.last_error.empty() ? "" : status.last_error.c_str());
    }
    context.task_handle = nullptr;
    g_ptp_started.store(false, std::memory_order_release);
}

void ptp_lab_task(void* argument) {
    auto& context = *static_cast<PtpLabContext*>(argument);
    vTaskDelay(kStartupDelay);

    if (!enable_hardware_ptp(context.eth_handle)) {
        ESP_LOGE(kTag, "PTP lab broadcaster stopped: hardware timestamp clock unavailable");
        finish_runtime(context);
        vTaskDelete(nullptr);
        return;
    }
    seed_hardware_clock(context.eth_handle);

    const auto mac_result = esp_eth_ioctl(
        context.eth_handle,
        ETH_CMD_G_MAC_ADDR,
        context.source_mac.data());
    if (mac_result != ESP_OK) {
        ESP_LOGE(kTag, "PTP lab broadcaster stopped: MAC address unavailable: %s",
                 esp_err_to_name(mac_result));
        finish_runtime(context);
        vTaskDelete(nullptr);
        return;
    }

    auto profile = make_runtime_options(context.source_mac);
    if (!profile.has_value()) {
        finish_runtime(context);
        vTaskDelete(nullptr);
        return;
    }

    context.runtime.emplace(std::move(*profile));
    if (!context.runtime->start()) {
        ESP_LOGE(kTag,
                 "PTP runtime rejected profile: %s",
                 context.runtime->status().last_error.c_str());
        finish_runtime(context);
        vTaskDelete(nullptr);
        return;
    }

    bool pdelay_enabled = false;
    if (context.runtime->options().respond_to_peer_delay &&
        context.pdelay_queue != nullptr) {
        const auto input_result = esp_eth_update_input_path_info(
            context.eth_handle,
            &ptp_input_info,
            &context);
        if (input_result == ESP_OK) {
            pdelay_enabled = true;
        } else {
            ESP_LOGW(kTag,
                     "Hardware RX timestamp path unavailable; Pdelay responder disabled: %s",
                     esp_err_to_name(input_result));
        }
    }

    const auto& options = context.runtime->options();
    const auto clock_identity = format_ptp_clock_identity(options.clock_identity);
    ESP_LOGW(kTag,
             "PTP LAB TX enabled: troubleshooting/interoperability helper only; not a GPS-backed or certified grandmaster");
    ESP_LOGI(kTag,
             "PTP runtime domain=%u transportSpecific=0x%X clockIdentity=%s port=%u VLAN=%s Announce=%lld ms Sync=%lld ms HW Sync TX=enabled HW Pdelay=%s",
             static_cast<unsigned>(options.domain_number),
             static_cast<unsigned>(options.transport_specific),
             clock_identity.c_str(),
             static_cast<unsigned>(options.port_number),
             options.vlan_id.has_value() ? "tagged" : "untagged",
             static_cast<long long>(options.announce_interval.count()),
             static_cast<long long>(options.sync_interval.count()),
             pdelay_enabled ? "enabled" : "disabled");

    std::uint32_t consecutive_failures = 0U;
    while (!g_stop_requested.load(std::memory_order_acquire)) {
        bool attempted = false;
        bool success = true;

        PdelayRequestEvent pdelay_request;
        while (context.pdelay_queue != nullptr &&
               xQueueReceive(context.pdelay_queue, &pdelay_request, 0U) == pdTRUE) {
            attempted = true;
            success = send_pdelay_response(context, pdelay_request) && success;
        }

        const auto due = context.runtime->poll_due();
        if (due.announce) {
            attempted = true;
            success = send_announce(context) && success;
        }
        if (due.sync) {
            attempted = true;
            success = send_sync_follow_up(context) && success;
        }

        if (attempted) {
            if (success) {
                consecutive_failures = 0U;
                context.runtime->clear_error();
            } else {
                context.runtime->record_error("Ethernet transmit or hardware timestamp failure");
                g_tx_failure_count.fetch_add(1U, std::memory_order_relaxed);
                ++consecutive_failures;
                if (consecutive_failures == 1U || (consecutive_failures % 16U) == 0U) {
                    ESP_LOGW(kTag,
                             "PTP TX failed (%lu consecutive); Ethernet link/driver may not be ready",
                             static_cast<unsigned long>(consecutive_failures));
                }
            }
        }

        ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(5));
    }

    finish_runtime(context);
    vTaskDelete(nullptr);
}

#else

void ptp_lab_task(void*) {
    ESP_LOGE(kTag,
             "PTP lab broadcaster requires ESP32-P4 IEEE1588 support and the ESP-IDF 5.x EMAC timestamp adapter");
    g_ptp_context.task_handle = nullptr;
    g_ptp_started.store(false, std::memory_order_release);
    vTaskDelete(nullptr);
}

#endif

void start_ptp_lab(const esp_eth_handle_t eth_handle) {
    if (eth_handle == nullptr) {
        ESP_LOGE(kTag, "PTP lab broadcaster not started: Ethernet handle is null");
        return;
    }

    bool expected = false;
    if (!g_ptp_started.compare_exchange_strong(
            expected,
            true,
            std::memory_order_acq_rel)) {
        return;
    }

    reset_live_status();
    g_stop_requested.store(false, std::memory_order_release);
    g_ptp_context.eth_handle = eth_handle;
    g_ptp_context.runtime.reset();
    g_ptp_context.task_handle = nullptr;

    if (g_ptp_context.pdelay_queue == nullptr) {
        g_ptp_context.pdelay_queue = xQueueCreate(
            kPdelayQueueDepth,
            sizeof(PdelayRequestEvent));
    } else {
        xQueueReset(g_ptp_context.pdelay_queue);
    }
    if (g_ptp_context.pdelay_queue == nullptr) {
        ESP_LOGW(kTag, "Pdelay queue allocation failed; broadcaster will run without Pdelay RX responses");
    }

    if (xTaskCreatePinnedToCore(
            &ptp_lab_task,
            "ar_ptp_lab",
            7168,
            &g_ptp_context,
            4,
            &g_ptp_context.task_handle,
            0) != pdPASS) {
        g_ptp_context.task_handle = nullptr;
        g_ptp_started.store(false, std::memory_order_release);
        ESP_LOGE(kTag, "Failed to create PTP lab task on CPU0");
    }
}

