masarray/arstack61850/embedded/esp32p4_smv_injector/main/ptp_lab_task.cpp
void stop_ptp_lab() noexcept {
    if (!g_ptp_started.load(std::memory_order_acquire)) return;
    g_stop_requested.store(true, std::memory_order_release);
    if (g_ptp_context.task_handle != nullptr) {
        xTaskNotifyGive(g_ptp_context.task_handle);
    }
}

[[nodiscard]] bool ptp_lab_is_running() noexcept {
    return g_ptp_started.load(std::memory_order_acquire);
}

[[nodiscard]] bool configure_ptp_lab(const ar_ptp_lab_config_t& config) {
    if (g_ptp_started.load(std::memory_order_acquire)) return false;
    std::string error;
    if (!validate_runtime_config(config, error)) {
        ESP_LOGE(kTag, "PTP runtime configuration rejected: %s", error.c_str());
        return false;
    }
    portENTER_CRITICAL(&g_control_mux);
    g_runtime_config_override = config;
    g_runtime_config_override_valid = true;
    portEXIT_CRITICAL(&g_control_mux);
    return true;
}

} // namespace
} // namespace ar::esp32p4::smv

extern "C" void ar_ptp_lab_get_default_config(ar_ptp_lab_config_t* config) {
    if (config == nullptr) return;
    ar::esp32p4::smv::fill_kconfig_defaults(*config);
}

extern "C" bool ar_ptp_lab_configure(const ar_ptp_lab_config_t* config) {
    if (config == nullptr) return false;
    return ar::esp32p4::smv::configure_ptp_lab(*config);
}

extern "C" bool ar_ptp_lab_get_config(ar_ptp_lab_config_t* config) {
    if (config == nullptr) return false;
    *config = ar::esp32p4::smv::selected_config();
    return true;
}

extern "C" void ar_ptp_lab_start(const esp_eth_handle_t eth_handle) {
    ar::esp32p4::smv::start_ptp_lab(eth_handle);
}

extern "C" void ar_ptp_lab_stop(void) {
    ar::esp32p4::smv::stop_ptp_lab();
}

extern "C" bool ar_ptp_lab_is_running(void) {
    return ar::esp32p4::smv::ptp_lab_is_running();
}

extern "C" bool ar_ptp_lab_get_status(ar_ptp_lab_status_t* status) {
    if (status == nullptr) return false;
    status->is_running = ar::esp32p4::smv::g_ptp_started.load(std::memory_order_acquire);
    status->announce_sent = ar::esp32p4::smv::g_announce_sent.load(std::memory_order_relaxed);
    status->sync_sent = ar::esp32p4::smv::g_sync_sent.load(std::memory_order_relaxed);
    status->follow_up_sent = ar::esp32p4::smv::g_follow_up_sent.load(std::memory_order_relaxed);
    status->peer_delay_frames_sent =
        ar::esp32p4::smv::g_pdelay_frames_sent.load(std::memory_order_relaxed);
    status->tx_failure_count =
        ar::esp32p4::smv::g_tx_failure_count.load(std::memory_order_relaxed);
    return true;
}
